ZeroToHero/SOAPBodyXml/Update.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Update xmlns="urn:microsoft-dynamics-schemas/page/employeepage">
      <EmployeePage>
        <Key>PASTE_KEY_HERE</Key>
        <EmployeeId>1001</EmployeeId>
        <EmployeeName>Mahesh</EmployeeName>
      </EmployeePage>
    </Update>
  </soap:Body>
</soap:Envelope>